Revit 2024 API
ExternalResourceServerUtils.IsValidShortName Method
 Checks whether the name is a valid short name for the external resource server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool IsValidShortName(
	Guid serverId,
	string serverName
)
Visual Basic
Public Shared Function IsValidShortName ( _
	serverId As Guid, _
	serverName As String _
) As Boolean
Visual C++
public:
static bool IsValidShortName(
	Guid serverId,
	String^ serverName
)
Parameters
serverId
Type: System.Guid
 The id of the external resource server.
serverName
Type: System.String
 The short name of the external resource server.
Return Value
 True if the name is a valid short name, false otherwise.
Remarks
 A valid short name should match the restrictions documented in GetShortName().
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceServerUtils Class
Autodesk.Revit.DB Namespace